# Проект FitLife - MVP версия 1.0

import sys

# Нужны для корректной работы unit-тестов
# (при запуске выдаёт ошибку с кодировкой utf-8 (тест №6) )
sys.stdin.reconfigure(encoding='utf-8')
sys.stdout.reconfigure(encoding='utf-8')

# Константы
WATER_PER_KG = 30  # Показывает, сколько необходимо мл. воды на каждый кг.

# Функции

# Документируем все функции (по аналогии ///summary///, как в C#),
# их входные параметры и возвращаемый результат,
# для их лучшего восприятия и получении подсказок при наведении на них


# Функция запроса имени у пользователя
def get_user_name():
    """Запрашивает имя пользователяю.

    Дополнительно осуществляет проверку введённого значения
    (только буквенное значение).

    Returns:
        str: имя пользователя, преобразованное через функцию capitalize()
    """
    while True:
        user_name = input('Пожалуйста, введите своё имя >> ')
        # Проверяем, что строка состоит только из букв
        if user_name.isalpha():
            # Возвращаем значение, первая буква которого большая,
            # остальные - маленькие
            return user_name.capitalize()
        print('Пожалуйста, введите корректной имя >> ')


# Функции запроса возраста у пользователя
def get_user_age():
    """Запрашивает возраст пользователя.

    Дополнительно осуществляет проверку введённого значения
    (только **ЦЕЛОЕ** числовое значение, больше нуля)

    Returns:
        int: возраст пользователя
    """
    while True:
        try:
            user_age = int(input('Пожалуйста, введите свой возраст >> '))
            # Проверяем, что введённое значение больше нуля
            if user_age > 0:
                return user_age
            print('Введённое значение должно быть целым и больше 0!')
        # Выводится в случаях, если введено не числовое значение
        except ValueError:
            print('Введённое значение должно содержать только цифры!')


# Функция запроса веса у пользователя
def get_user_weight():
    """Запрашивает вес пользователя.

    Дополнительно осуществляет проверку введённого значения
    (только **ЦЕЛОЕ** числовое значение, больше нуля)

    Returns:
        float: вес пользователя
    """
    while True:
        try:
            # Разрешаем вводить дробные значения через запятую
            user_weight = float(
                input(
                    'Пожалуйста, введите свой вес (в кг), '
                    'отделяя килограммы и граммы точкой или запятой >> '
                ).replace(',', '.')
            )
            # Проверяем, что введённое значение больше нуля
            if user_weight > 0:
                return user_weight
            print('Введённое значение должно быть больше 0!')
        # Выводится в случаях, если введено не числовое значение
        except ValueError:
            print('Введённое значение должно содержать только цифры!')


# Функция запроса роста у пользователя
def get_user_height():
    """Запрашивает рост у пользователя.

    Дополнительно осуществляет проверку введённого значения
    (только **ЦЕЛОЕ** числовое значение, больше нуля)

    Returns:
        float: рост пользователя

    """
    while True:
        try:
            # Разрешаем вводить дробные значения через запятую
            user_height = float(
                input(
                    'Пожалуйста, введите свой рост (в метрах), '
                    'отделяя метры и сантиметры точкой или запятой >> '
                ).replace(',', '.')
            )
            # Проверяем, что введённое значение больше нуля
            if user_height > 0:
                return user_height
            else:
                print('Введённое значение должно быть больше 0!')
        # Выводится в случаях, если введено не числовое значение
        except ValueError:
            print('Введённое значение должно содержать только цифры!')


# Функция расчёта ИМТ (индекса массы тела) у пользователя
def calculate_bmi(
        user_weight: float,
        user_height: float
):
    """Вычисляет индекс массы тела пользователя.

    Args:
        user_weight (float): Вес в килограммах.
        user_height (float): Рост в метрах.

    Returns:
        float: индекс массы тела, округлённый до одного знака
    """
    return round(user_weight / (user_height ** 2), 1)


# Функция расчёта необходимого количества воды
def calculate_nedeed_water(user_weight: float):
    """Вычисляет необходимое количество воды для пользователя.

    Args:
        user_weight (float): Вес пользователя

    Returns:
        float: необходимое количество воды в литрах,
            округлённое до одного знака
    """
    return round(user_weight * WATER_PER_KG / 1000, 1)


# Функция вывода результата для пользователя
def print_result(
        user_name: str,
        user_age: int,
        user_height: float,
        user_weight: float,
        user_bmi: float,
        user_water_needed: float
):
    """Выводит пользователю вычисленные значения

    Args:
        user_name (str): Имя пользователя
        user_age (int): Возраст пользователя
        user_height (float): Рост пользователя
        user_weight (float): Вес пользователя
        user_bmi (float): ИМТ пользователя
        user_water_needed (float): Необходимое количество воды
    """
    print(f'Привет, {user_name}! ({user_age} лет)')
    print(
        f'Исходя из твоего роста ({user_height} м.) и '
        f'массы тела ({user_weight} кг.),'
        f'твой индекс массы тела: {user_bmi}'
    )
    print(f'Рекомендуемая норма воды: {user_water_needed} л. в день\n')
    print("Расчет окончен. Будьте здоровы!")


# Функция вывода делителя (визуал)
def print_separator(count_separators=40):
    """Выводит разделительную линию из символов '='

    Args:
        count_separatos (int): Количество символов - разделения '='.
            Значение по умолчанию 40.
    """
    print('=' * count_separators)


# ЯДРО ПРОГРАММЫ

print('Привет! Добро пожаловать в фитнес-бота Fit Life!')
user_name = get_user_name()
user_age = get_user_age()
user_weight = get_user_weight()
user_height = get_user_height()

user_bmi = calculate_bmi(user_weight, user_height)
user_water_nedeed = calculate_nedeed_water(user_weight)

print_separator()
print_result(
    user_name,
    user_age,
    user_height,
    user_weight,
    user_bmi,
    user_water_nedeed
)
